[
    {
      "category": "love",
      "message": "Thank you Shin Shin for always being my pillar of support. Without you, I would not have enough strength to press on every single day"
    },
    {
      "category": "encouragement",
      "message": "I know that you have been working hard lately. I am very proud of you."
    },
    {
      "category": "how i feel about shin",
      "message": "To me, you have been the most wonderful person I could ever ask for. You make me feel the happiest I have ever been"
    },
    {
      "category": "love",
      "message": "Thank you for making me laugh so brightly"
    },
    {
      "category": "encouragement",
      "message": "I will always support you in whatever you do. Eventhough I dont say it directly most of the time, just know that I will always be there for every step of your journey"
    },
    {
      "category": "how i feel about shin",
      "message": "From day one, I have always felt that you are so capable. I know that its not in your dictionary to give up on pursuing your goals but remember to take breaks when you are tired."
    },
    {
      "category": "encouragement",
      "message": "I believe in you alwaysssssssssss pyng shin heannnnnn"
    },
    {
      "category": "messages for occasions",
      "message": "This should have been an occasion message but we dont have any upcoming occasions. SOOO.. I just wanted to compliment you for the effort you have put in to the MCS hari raya event. You did an amazinggggg job. It was a super duper awesome event. Your work put a smile on everybody's face that day. (13 April 2025)"
    },
    {
      "category": "love",
      "message": "Thank you baby for always choosing me and loving me everyday"
    },
    {
      "category": "encouragement",
      "message": " JIAYOUUUUUU SHIN SHIN "
    },
    {
      "category": "how i feel about shin",
      "message": "Although we have our fair share of arguments, differences, and misunderstandings... You have always made me feel that I am enough. Even so, I hope you know that I am trying to be better, and I am still learning how I can support you better as a partner"
    },
    {
      "category": "how i feel about shin",
      "message": "Though I dont say it very often or even at all, I am grateful for you and I pray everyday for you to be safe and for good things to come your way"
    },
    {
      "category": "love",
      "message": "Thank you for always making sure that I go home safe and on time"
    },
    {
      "category": "love",
      "message": "I love you"
    },
    {
      "category": "love",
      "message": "I love you, thank you for making me feel so loved all the time"
    },
    {
      "category": "love",
      "message": "Thank you for holding my hand tight tight all the time"
    },
    {
      "category": "love",
      "message": "Thank you for always giving me warm hugs and never wanting to let go"
    },
    {
      "category": "love",
      "message": "You have always kept your word and promise with me. Thank you for not forgetting and always remembering "
    },
    {
      "category": "encouragement",
      "message": "Baby babyyyy jiayou for workkkkk heheheh i love youuu"
    },
    {
      "category": "encouragement",
      "message": "baby baby you can do itttttt"
    },
    {
      "category": "encouragement",
      "message": "i believe in youuuuuuuuu"
    },
    {
      "category": "encouragement",
      "message": "GOOD JOB SHIN SHINNNNNNN"
    },
      "category": "love",
      "message": "Thank you for loving me everyday"
    },
      "category": "love",
      "message": "Baby baby im so thankful to have met you i really feel so thankful because you really brought alot of change to my life"
    }
  ]
  
